tap "danielgtaylor/restish"
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "act"
brew "bat"
brew "glib"
brew "cairo"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glslviewer"
brew "go"
brew "jq"
brew "libpq", link: true
brew "markdown-oxide"
brew "neovim"
brew "node"
brew "pdm"
brew "pnpm"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "sesh"
brew "sevenzip"
brew "stow"
brew "tmux"
brew "tree"
brew "typos-cli"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "danielgtaylor/restish/restish"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "kitty"
cask "notunes"
cask "obsidian"
cask "pomatez"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
vscode "a-h.templ"
vscode "adpyke.vscode-sql-formatter"
vscode "amodio.tsl-problem-matcher"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "connor4312.esbuild-problem-matchers"
vscode "csstools.postcss"
vscode "cstrap.python-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "humao.rest-client"
vscode "idleberg.applescript"
vscode "joshmu.periscope"
vscode "lkrms.inifmt"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nolanderc.glsl-analyzer"
vscode "quary.sqruff"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "slevesque.shader"
vscode "takumii.markdowntable"
vscode "tekumara.typos-vscode"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
