tap "danielgtaylor/restish"
tap "dwarvesf/tap"
tap "felixkratz/formulae"
tap "j178/tap"
tap "joshmedeski/sesh"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "act"
brew "actionlint"
brew "antidote"
brew "atuin"
brew "awscli"
brew "bat"
brew "biome"
brew "glib"
brew "cairo"
brew "cloc"
brew "csvlens"
brew "eza"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glslviewer"
brew "go"
brew "gron"
brew "htop"
brew "jq"
brew "lazygit"
brew "libpq", link: true
brew "markdown-oxide"
brew "mise"
brew "neovim"
brew "node"
brew "pdm"
brew "pnpm"
brew "pre-commit"
brew "pyenv"
brew "qsv"
brew "restish"
brew "ripgrep"
brew "sesh"
brew "sevenzip"
brew "shfmt"
brew "starship"
brew "stow"
brew "taplo"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "uv"
brew "xh"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "alt-tab"
cask "claude"
cask "cursor"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "notunes"
cask "obsidian"
cask "pomatez"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "visual-studio-code"
vscode "a-h.templ"
vscode "adpyke.vscode-sql-formatter"
vscode "amodio.tsl-problem-matcher"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "connor4312.esbuild-problem-matchers"
vscode "csstools.postcss"
vscode "cstrap.python-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "detachhead.basedpyright"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "humao.rest-client"
vscode "joshmu.periscope"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nolanderc.glsl-analyzer"
vscode "quary.sqruff"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "slevesque.shader"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
