[
  "obsidian-excalidraw-plugin",
  "mermaid-tools",
  "dataview",
  "nldates-obsidian",
  "actions-uri",
  "quickadd",
  "url-into-selection",
  "obsidian-advanced-new-file",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-linter",
  "obsidian-relative-line-numbers",
  "omnisearch",
  "single-file-daily-notes",
  "daily-notes-editor",
  "slash-commander",
  "obsidian-hotkeys-for-templates",
  "obsidian-advanced-uri",
  "obsidian-vimrc-support"
]
