# ZSH Plugins managed by Antidote
# Order matters: fzf-tab must come after compinit
# syntax-highlighting should be last

mattmc3/ez-compinit

zsh-users/zsh-autosuggestions
zsh-users/zsh-completions

ohmyzsh/ohmyzsh path:plugins/vi-mode
lukechilds/zsh-nvm
Aloxaf/fzf-tab kind:defer
junegunn/fzf-git.sh kind:defer

zsh-users/zsh-syntax-highlighting
